Model summary
-------------
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_57 (Dense)             (None, 20)                620       
_________________________________________________________________
activation_43 (Activation)   (None, 20)                0         
_________________________________________________________________
dense_58 (Dense)             (None, 10)                210       
_________________________________________________________________
activation_44 (Activation)   (None, 10)                0         
_________________________________________________________________
dense_59 (Dense)             (None, 5)                 55        
_________________________________________________________________
activation_45 (Activation)   (None, 5)                 0         
_________________________________________________________________
dense_60 (Dense)             (None, 6)                 36        
=================================================================
Total params: 921
Trainable params: 921
Non-trainable params: 0
_________________________________________________________________


Cross validation
----------------
----  --  --------  --------
it-1  32  0.425577  0.629963
it-2  15  0.582956  0.564983
it-3  14  0.469754  0.833356
it-4  39  0.426304  0.50733
mean  25  0.476148  0.633908
----  --  --------  --------

Final training
--------------
Epochs: 25
Loss: 0.4248206510361053