Model summary
-------------
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_17 (Dense)             (None, 20)                180       
_________________________________________________________________
activation_13 (Activation)   (None, 20)                0         
_________________________________________________________________
dense_18 (Dense)             (None, 10)                210       
_________________________________________________________________
activation_14 (Activation)   (None, 10)                0         
_________________________________________________________________
dense_19 (Dense)             (None, 5)                 55        
_________________________________________________________________
activation_15 (Activation)   (None, 5)                 0         
_________________________________________________________________
dense_20 (Dense)             (None, 6)                 36        
=================================================================
Total params: 481
Trainable params: 481
Non-trainable params: 0
_________________________________________________________________


Cross validation
----------------
----  -----  --------  --------
it-1  33     0.481143  0.610251
it-2  55     0.62214   0.433904
it-3  38     0.464842  0.733678
it-4  41     0.511645  0.514389
mean  41.75  0.519943  0.573055
----  -----  --------  --------

Final training
--------------
Epochs: 41
Loss: 0.4315421646557221