Model summary
-------------
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_77 (Dense)             (None, 20)                620       
_________________________________________________________________
activation_58 (Activation)   (None, 20)                0         
_________________________________________________________________
dense_78 (Dense)             (None, 10)                210       
_________________________________________________________________
activation_59 (Activation)   (None, 10)                0         
_________________________________________________________________
dense_79 (Dense)             (None, 5)                 55        
_________________________________________________________________
activation_60 (Activation)   (None, 5)                 0         
_________________________________________________________________
dense_80 (Dense)             (None, 6)                 36        
=================================================================
Total params: 921
Trainable params: 921
Non-trainable params: 0
_________________________________________________________________


Cross validation
----------------
----  --  --------  --------
it-1  30  0.858022  1.1426
it-2  33  0.765081  0.595102
it-3  24  0.615655  0.944693
it-4  29  0.765329  0.836192
mean  29  0.751022  0.879646
----  --  --------  --------

Final training
--------------
Epochs: 29
Loss: 0.6689170705181633