Model summary
-------------
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_37 (Dense)             (None, 20)                180       
_________________________________________________________________
activation_28 (Activation)   (None, 20)                0         
_________________________________________________________________
dense_38 (Dense)             (None, 10)                210       
_________________________________________________________________
activation_29 (Activation)   (None, 10)                0         
_________________________________________________________________
dense_39 (Dense)             (None, 5)                 55        
_________________________________________________________________
activation_30 (Activation)   (None, 5)                 0         
_________________________________________________________________
dense_40 (Dense)             (None, 6)                 36        
=================================================================
Total params: 481
Trainable params: 481
Non-trainable params: 0
_________________________________________________________________


Cross validation
----------------
----  --  --------  --------
it-1  18  0.732012  0.881332
it-2  44  0.755999  0.613171
it-3  41  0.713337  1.08732
it-4  69  0.612055  0.753691
mean  43  0.703351  0.83388
----  --  --------  --------

Final training
--------------
Epochs: 43
Loss: 0.6191383232414422