Model summary
-------------
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_97 (Dense)             (None, 20)                620       
_________________________________________________________________
activation_73 (Activation)   (None, 20)                0         
_________________________________________________________________
dense_98 (Dense)             (None, 10)                210       
_________________________________________________________________
activation_74 (Activation)   (None, 10)                0         
_________________________________________________________________
dense_99 (Dense)             (None, 5)                 55        
_________________________________________________________________
activation_75 (Activation)   (None, 5)                 0         
_________________________________________________________________
dense_100 (Dense)            (None, 6)                 36        
=================================================================
Total params: 921
Trainable params: 921
Non-trainable params: 0
_________________________________________________________________


Cross validation
----------------
----  ----  --------  --------
it-1  36    0.804894  0.828089
it-2  20    1.07374   1.03761
it-3  20    0.813167  1.13821
it-4  58    0.903759  1.00598
mean  33.5  0.898889  1.00247
----  ----  --------  --------

Final training
--------------
Epochs: 33
Loss: 0.7770853065355946