Model summary
-------------
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_77 (Dense)             (None, 20)                180       
_________________________________________________________________
activation_58 (Activation)   (None, 20)                0         
_________________________________________________________________
dense_78 (Dense)             (None, 10)                210       
_________________________________________________________________
activation_59 (Activation)   (None, 10)                0         
_________________________________________________________________
dense_79 (Dense)             (None, 5)                 55        
_________________________________________________________________
activation_60 (Activation)   (None, 5)                 0         
_________________________________________________________________
dense_80 (Dense)             (None, 6)                 36        
=================================================================
Total params: 481
Trainable params: 481
Non-trainable params: 0
_________________________________________________________________


Cross validation
----------------
----  ----  --------  --------
it-1  22    0.886868  0.960742
it-2  47    0.95573   0.833147
it-3  21    0.829771  1.38049
it-4  40    0.897508  0.939406
mean  32.5  0.89247   1.02845
----  ----  --------  --------

Final training
--------------
Epochs: 32
Loss: 0.8805508632794862