Model summary
-------------
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_129 (Dense)            (None, 20)                620       
_________________________________________________________________
activation_97 (Activation)   (None, 20)                0         
_________________________________________________________________
dense_130 (Dense)            (None, 10)                210       
_________________________________________________________________
activation_98 (Activation)   (None, 10)                0         
_________________________________________________________________
dense_131 (Dense)            (None, 5)                 55        
_________________________________________________________________
activation_99 (Activation)   (None, 5)                 0         
_________________________________________________________________
dense_132 (Dense)            (None, 6)                 36        
=================================================================
Total params: 921
Trainable params: 921
Non-trainable params: 0
_________________________________________________________________


Cross validation
----------------
----  ----  --------  --------
it-1  27    0.876128  0.958328
it-2  17    0.959511  0.838998
it-3  29    0.788872  1.41127
it-4  21    0.934785  1.18579
mean  23.5  0.889824  1.0986
----  ----  --------  --------

Final training
--------------
Epochs: 23
Loss: 0.8110900568868845