Model summary
-------------
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_17 (Dense)             (None, 20)                220       
_________________________________________________________________
activation_13 (Activation)   (None, 20)                0         
_________________________________________________________________
dense_18 (Dense)             (None, 10)                210       
_________________________________________________________________
activation_14 (Activation)   (None, 10)                0         
_________________________________________________________________
dense_19 (Dense)             (None, 5)                 55        
_________________________________________________________________
activation_15 (Activation)   (None, 5)                 0         
_________________________________________________________________
dense_20 (Dense)             (None, 6)                 36        
=================================================================
Total params: 521
Trainable params: 521
Non-trainable params: 0
_________________________________________________________________


Cross validation
----------------
----  -----  --------  --------
it-1  69     0.39097   0.56826
it-2  45     0.420418  0.359174
it-3  42     0.421002  0.687225
it-4  55     0.354381  0.481651
mean  52.75  0.396693  0.524078
----  -----  --------  --------

Final training
--------------
Epochs: 52
Loss: 0.37687778033139435