Model summary
-------------
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_37 (Dense)             (None, 20)                220       
_________________________________________________________________
activation_28 (Activation)   (None, 20)                0         
_________________________________________________________________
dense_38 (Dense)             (None, 10)                210       
_________________________________________________________________
activation_29 (Activation)   (None, 10)                0         
_________________________________________________________________
dense_39 (Dense)             (None, 5)                 55        
_________________________________________________________________
activation_30 (Activation)   (None, 5)                 0         
_________________________________________________________________
dense_40 (Dense)             (None, 6)                 36        
=================================================================
Total params: 521
Trainable params: 521
Non-trainable params: 0
_________________________________________________________________


Cross validation
----------------
----  -----  --------  --------
it-1  21     0.691505  0.883513
it-2  79     0.599473  0.571394
it-3  66     0.584498  0.952933
it-4  41     0.61641   0.732176
mean  51.75  0.622972  0.785004
----  -----  --------  --------

Final training
--------------
Epochs: 51
Loss: 0.5486713820685645