Model summary
-------------
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_57 (Dense)             (None, 20)                220       
_________________________________________________________________
activation_43 (Activation)   (None, 20)                0         
_________________________________________________________________
dense_58 (Dense)             (None, 10)                210       
_________________________________________________________________
activation_44 (Activation)   (None, 10)                0         
_________________________________________________________________
dense_59 (Dense)             (None, 5)                 55        
_________________________________________________________________
activation_45 (Activation)   (None, 5)                 0         
_________________________________________________________________
dense_60 (Dense)             (None, 6)                 36        
=================================================================
Total params: 521
Trainable params: 521
Non-trainable params: 0
_________________________________________________________________


Cross validation
----------------
----  -----  --------  --------
it-1  49     0.749691  0.930333
it-2  44     0.745345  0.659602
it-3  34     0.807062  1.12049
it-4  28     0.753649  0.956153
mean  38.75  0.763937  0.916644
----  -----  --------  --------

Final training
--------------
Epochs: 38
Loss: 0.6613007343954143