Model summary
-------------
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_77 (Dense)             (None, 20)                220       
_________________________________________________________________
activation_58 (Activation)   (None, 20)                0         
_________________________________________________________________
dense_78 (Dense)             (None, 10)                210       
_________________________________________________________________
activation_59 (Activation)   (None, 10)                0         
_________________________________________________________________
dense_79 (Dense)             (None, 5)                 55        
_________________________________________________________________
activation_60 (Activation)   (None, 5)                 0         
_________________________________________________________________
dense_80 (Dense)             (None, 6)                 36        
=================================================================
Total params: 521
Trainable params: 521
Non-trainable params: 0
_________________________________________________________________


Cross validation
----------------
----  ----  --------  --------
it-1  34    0.869861  0.949121
it-2  33    0.906656  0.856935
it-3  18    0.843023  1.1569
it-4  17    0.88455   1.01717
mean  25.5  0.876023  0.995031
----  ----  --------  --------

Final training
--------------
Epochs: 25
Loss: 0.9071943047233527