Model summary
-------------
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_11 (InputLayer)            (None, 34, 21)        0                                            
____________________________________________________________________________________________________
conv1d_11 (Conv1D)               (None, 34, 32)        3392        input_11[0][0]                   
____________________________________________________________________________________________________
conv1d_12 (Conv1D)               (None, 34, 10)        970         conv1d_11[0][0]                  
____________________________________________________________________________________________________
flatten_6 (Flatten)              (None, 340)           0           conv1d_12[0][0]                  
____________________________________________________________________________________________________
input_12 (InputLayer)            (None, 2)             0                                            
____________________________________________________________________________________________________
dense_21 (Dense)                 (None, 10)            3410        flatten_6[0][0]                  
____________________________________________________________________________________________________
dense_22 (Dense)                 (None, 5)             15          input_12[0][0]                   
____________________________________________________________________________________________________
concatenate_6 (Concatenate)      (None, 15)            0           dense_21[0][0]                   
                                                                   dense_22[0][0]                   
____________________________________________________________________________________________________
dense_23 (Dense)                 (None, 20)            320         concatenate_6[0][0]              
____________________________________________________________________________________________________
dense_24 (Dense)                 (None, 34)            714         dense_23[0][0]                   
====================================================================================================
Total params: 8,821
Trainable params: 8,821
Non-trainable params: 0
____________________________________________________________________________________________________


Cross validation
----------------
------------------------  --  --------  -------
it-1                       9  1.61723   3.19475
it-2                       4  2.657     4.71962
it-3                      51  0.804809  2.94688
it-4                      33  1.08553   2.56883
it-5                      35  1.02743   2.34617
mean (median for epochs)  33  1.4384    3.15525
------------------------  --  --------  -------

Final training
--------------
Epochs: 33
Loss: 1.0858934616702869