Model summary
-------------
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_11 (InputLayer)            (None, 33, 21)        0                                            
____________________________________________________________________________________________________
conv1d_11 (Conv1D)               (None, 33, 32)        3392        input_11[0][0]                   
____________________________________________________________________________________________________
conv1d_12 (Conv1D)               (None, 33, 10)        970         conv1d_11[0][0]                  
____________________________________________________________________________________________________
flatten_6 (Flatten)              (None, 330)           0           conv1d_12[0][0]                  
____________________________________________________________________________________________________
input_12 (InputLayer)            (None, 2)             0                                            
____________________________________________________________________________________________________
dense_21 (Dense)                 (None, 10)            3310        flatten_6[0][0]                  
____________________________________________________________________________________________________
dense_22 (Dense)                 (None, 5)             15          input_12[0][0]                   
____________________________________________________________________________________________________
concatenate_6 (Concatenate)      (None, 15)            0           dense_21[0][0]                   
                                                                   dense_22[0][0]                   
____________________________________________________________________________________________________
dense_23 (Dense)                 (None, 20)            320         concatenate_6[0][0]              
____________________________________________________________________________________________________
dense_24 (Dense)                 (None, 33)            693         dense_23[0][0]                   
====================================================================================================
Total params: 8,700
Trainable params: 8,700
Non-trainable params: 0
____________________________________________________________________________________________________


Cross validation
----------------
------------------------  --  -------  -------
it-1                       4  1.92386  4.24754
it-2                       6  1.8783   3.19374
it-3                      30  1.21878  1.45012
it-4                      10  1.71517  2.27067
it-5                      28  1.12703  2.16325
mean (median for epochs)  10  1.57263  2.66506
------------------------  --  -------  -------

Final training
--------------
Epochs: 10
Loss: 1.6101459706331043