Model summary
-------------
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_11 (InputLayer)            (None, 130, 21)       0                                            
____________________________________________________________________________________________________
conv1d_11 (Conv1D)               (None, 130, 10)       640         input_11[0][0]                   
____________________________________________________________________________________________________
conv1d_12 (Conv1D)               (None, 130, 10)       310         conv1d_11[0][0]                  
____________________________________________________________________________________________________
flatten_6 (Flatten)              (None, 1300)          0           conv1d_12[0][0]                  
____________________________________________________________________________________________________
input_12 (InputLayer)            (None, 2)             0                                            
____________________________________________________________________________________________________
dense_21 (Dense)                 (None, 10)            13010       flatten_6[0][0]                  
____________________________________________________________________________________________________
dense_22 (Dense)                 (None, 5)             15          input_12[0][0]                   
____________________________________________________________________________________________________
concatenate_6 (Concatenate)      (None, 15)            0           dense_21[0][0]                   
                                                                   dense_22[0][0]                   
____________________________________________________________________________________________________
dense_23 (Dense)                 (None, 20)            320         concatenate_6[0][0]              
____________________________________________________________________________________________________
dense_24 (Dense)                 (None, 130)           2730        dense_23[0][0]                   
====================================================================================================
Total params: 17,025
Trainable params: 17,025
Non-trainable params: 0
____________________________________________________________________________________________________


Cross validation
----------------
------------------------  --  -------  -------
it-1                      41  2.58574  2.94903
it-2                      44  2.61684  2.60606
it-3                      32  2.57704  3.21007
it-4                      36  2.5855   2.90888
it-5                      98  2.38475  2.03522
mean (median for epochs)  41  2.54997  2.74185
------------------------  --  -------  -------

Final training
--------------
Epochs: 41
Loss: 2.6174309119440644