Model summary
-------------
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_9 (InputLayer)             (None, 130, 4)        0                                            
____________________________________________________________________________________________________
conv1d_9 (Conv1D)                (None, 130, 32)       672         input_9[0][0]                    
____________________________________________________________________________________________________
conv1d_10 (Conv1D)               (None, 130, 10)       970         conv1d_9[0][0]                   
____________________________________________________________________________________________________
input_10 (InputLayer)            (None, 2)             0                                            
____________________________________________________________________________________________________
flatten_5 (Flatten)              (None, 1300)          0           conv1d_10[0][0]                  
____________________________________________________________________________________________________
dense_22 (Dense)                 (None, 10)            30          input_10[0][0]                   
____________________________________________________________________________________________________
dense_21 (Dense)                 (None, 10)            13010       flatten_5[0][0]                  
____________________________________________________________________________________________________
dense_23 (Dense)                 (None, 10)            110         dense_22[0][0]                   
____________________________________________________________________________________________________
concatenate_5 (Concatenate)      (None, 20)            0           dense_21[0][0]                   
                                                                   dense_23[0][0]                   
____________________________________________________________________________________________________
dense_24 (Dense)                 (None, 20)            420         concatenate_5[0][0]              
____________________________________________________________________________________________________
dense_25 (Dense)                 (None, 130)           2730        dense_24[0][0]                   
====================================================================================================
Total params: 17,942
Trainable params: 17,942
Non-trainable params: 0
____________________________________________________________________________________________________


Cross validation
----------------
----  --  -------  -------
it-1  40  2.60004  3.00779
it-2  46  2.66743  2.61339
it-3  24  2.66992  3.27118
it-4  34  2.63361  2.94742
mean  36  2.64275  2.95994
----  --  -------  -------

Final training
--------------
Epochs: 36
Loss: 2.613145837536106