Model summary
-------------
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_19 (InputLayer)            (None, 130, 4)        0                                            
____________________________________________________________________________________________________
conv1d_19 (Conv1D)               (None, 130, 32)       672         input_19[0][0]                   
____________________________________________________________________________________________________
conv1d_20 (Conv1D)               (None, 130, 10)       970         conv1d_19[0][0]                  
____________________________________________________________________________________________________
input_20 (InputLayer)            (None, 2)             0                                            
____________________________________________________________________________________________________
flatten_10 (Flatten)             (None, 1300)          0           conv1d_20[0][0]                  
____________________________________________________________________________________________________
dense_47 (Dense)                 (None, 10)            30          input_20[0][0]                   
____________________________________________________________________________________________________
dense_46 (Dense)                 (None, 10)            13010       flatten_10[0][0]                 
____________________________________________________________________________________________________
dense_48 (Dense)                 (None, 10)            110         dense_47[0][0]                   
____________________________________________________________________________________________________
concatenate_10 (Concatenate)     (None, 20)            0           dense_46[0][0]                   
                                                                   dense_48[0][0]                   
____________________________________________________________________________________________________
dense_49 (Dense)                 (None, 20)            420         concatenate_10[0][0]             
____________________________________________________________________________________________________
dense_50 (Dense)                 (None, 130)           2730        dense_49[0][0]                   
====================================================================================================
Total params: 17,942
Trainable params: 17,942
Non-trainable params: 0
____________________________________________________________________________________________________


Cross validation
----------------
----  -----  -------  -------
it-1  40     2.7568   3.21176
it-2  34     2.84942  2.81883
it-3  39     2.76163  3.53658
it-4  38     2.79691  3.05859
mean  37.75  2.79119  3.15644
----  -----  -------  -------

Final training
--------------
Epochs: 37
Loss: 2.764912986136102