Model summary
-------------
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_29 (InputLayer)            (None, 130, 4)        0                                            
____________________________________________________________________________________________________
conv1d_29 (Conv1D)               (None, 130, 32)       672         input_29[0][0]                   
____________________________________________________________________________________________________
conv1d_30 (Conv1D)               (None, 130, 10)       970         conv1d_29[0][0]                  
____________________________________________________________________________________________________
input_30 (InputLayer)            (None, 2)             0                                            
____________________________________________________________________________________________________
flatten_15 (Flatten)             (None, 1300)          0           conv1d_30[0][0]                  
____________________________________________________________________________________________________
dense_72 (Dense)                 (None, 10)            30          input_30[0][0]                   
____________________________________________________________________________________________________
dense_71 (Dense)                 (None, 10)            13010       flatten_15[0][0]                 
____________________________________________________________________________________________________
dense_73 (Dense)                 (None, 10)            110         dense_72[0][0]                   
____________________________________________________________________________________________________
concatenate_15 (Concatenate)     (None, 20)            0           dense_71[0][0]                   
                                                                   dense_73[0][0]                   
____________________________________________________________________________________________________
dense_74 (Dense)                 (None, 20)            420         concatenate_15[0][0]             
____________________________________________________________________________________________________
dense_75 (Dense)                 (None, 130)           2730        dense_74[0][0]                   
====================================================================================================
Total params: 17,942
Trainable params: 17,942
Non-trainable params: 0
____________________________________________________________________________________________________


Cross validation
----------------
----  -----  -------  -------
it-1  34     2.92189  3.2649
it-2  30     3.01804  2.89977
it-3  32     2.87525  3.6324
it-4  29     2.96965  3.21801
mean  31.25  2.94621  3.25377
----  -----  -------  -------

Final training
--------------
Epochs: 31
Loss: 2.9265092905465657