Model summary
-------------
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_39 (InputLayer)            (None, 130, 4)        0                                            
____________________________________________________________________________________________________
conv1d_39 (Conv1D)               (None, 130, 32)       672         input_39[0][0]                   
____________________________________________________________________________________________________
conv1d_40 (Conv1D)               (None, 130, 10)       970         conv1d_39[0][0]                  
____________________________________________________________________________________________________
input_40 (InputLayer)            (None, 2)             0                                            
____________________________________________________________________________________________________
flatten_20 (Flatten)             (None, 1300)          0           conv1d_40[0][0]                  
____________________________________________________________________________________________________
dense_97 (Dense)                 (None, 10)            30          input_40[0][0]                   
____________________________________________________________________________________________________
dense_96 (Dense)                 (None, 10)            13010       flatten_20[0][0]                 
____________________________________________________________________________________________________
dense_98 (Dense)                 (None, 10)            110         dense_97[0][0]                   
____________________________________________________________________________________________________
concatenate_20 (Concatenate)     (None, 20)            0           dense_96[0][0]                   
                                                                   dense_98[0][0]                   
____________________________________________________________________________________________________
dense_99 (Dense)                 (None, 20)            420         concatenate_20[0][0]             
____________________________________________________________________________________________________
dense_100 (Dense)                (None, 130)           2730        dense_99[0][0]                   
====================================================================================================
Total params: 17,942
Trainable params: 17,942
Non-trainable params: 0
____________________________________________________________________________________________________


Cross validation
----------------
----  ----  -------  -------
it-1  40    2.92616  3.4191
it-2  47    2.97918  3.16991
it-3  32    2.97365  3.74474
it-4  47    2.96237  3.20087
mean  41.5  2.96034  3.38366
----  ----  -------  -------

Final training
--------------
Epochs: 41
Loss: 3.003463379748456