Model summary
-------------
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_11 (InputLayer)            (None, 130, 21)       0                                            
____________________________________________________________________________________________________
conv1d_11 (Conv1D)               (None, 130, 10)       640         input_11[0][0]                   
____________________________________________________________________________________________________
conv1d_12 (Conv1D)               (None, 130, 10)       310         conv1d_11[0][0]                  
____________________________________________________________________________________________________
flatten_6 (Flatten)              (None, 1300)          0           conv1d_12[0][0]                  
____________________________________________________________________________________________________
input_12 (InputLayer)            (None, 2)             0                                            
____________________________________________________________________________________________________
dense_21 (Dense)                 (None, 10)            13010       flatten_6[0][0]                  
____________________________________________________________________________________________________
dense_22 (Dense)                 (None, 5)             15          input_12[0][0]                   
____________________________________________________________________________________________________
concatenate_6 (Concatenate)      (None, 15)            0           dense_21[0][0]                   
                                                                   dense_22[0][0]                   
____________________________________________________________________________________________________
dense_23 (Dense)                 (None, 20)            320         concatenate_6[0][0]              
____________________________________________________________________________________________________
dense_24 (Dense)                 (None, 130)           2730        dense_23[0][0]                   
====================================================================================================
Total params: 17,025
Trainable params: 17,025
Non-trainable params: 0
____________________________________________________________________________________________________


Cross validation
----------------
------------------------  --  -------  -------
it-1                      43  2.8132   3.05378
it-2                      40  2.84792  2.78138
it-3                      28  2.84056  3.54518
it-4                      34  2.7944   3.15243
it-5                      47  2.7686   2.48758
mean (median for epochs)  40  2.81294  3.00407
------------------------  --  -------  -------

Final training
--------------
Epochs: 40
Loss: 2.8084394114958866